# yolov5s_cbam.yaml

# 参数说明：
# - [from, number, module, args]
# from: 上一层索引或-1表示前一层
# number: 重复次数
# module: 模块名
# args: 模块参数

# 输入通道c1，输出通道c2等

nc: 4
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],           # 0, P1/2
   [-1, 1, CBAM, [64]],                    # 1, 新增CBAM模块
   [-1, 3, C3, [64]],                      # 2
   [-1, 1, Conv, [128, 3, 2]],             # 3
   [-1, 1, CBAM, [128]],                   # 4
   [-1, 3, C3, [128, False]],              # 5
   [-1, 1, Conv, [256, 3, 2]],             # 6
   [-1, 1, CBAM, [256]],                   # 7
   [-1, 3, C3, [256, False]],              # 8
   [-1, 1, Conv, [512, 3, 2]],             # 9
   [-1, 1, CBAM, [512]],                   # 10
   [-1, 1, SPPF, [512, 5]]                 # 11
  ]

head:
  [[-1, 1, Conv, [256, 1, 1]],             # 0
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 1
   [[-1, 8], 1, Concat, [1]],              # 2
   [-1, 3, C3, [256, False]],               # 3
   [-1, 1, CBAM, [256]],                    # 4
   [-1, 1, Conv, [128, 1, 1]],             # 5
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 6
   [[-1, 5], 1, Concat, [1]],              # 7
   [-1, 3, C3, [128, False]],               # 8
   [-1, 1, CBAM, [128]],                    # 9
   [-1, 1, Conv, [128, 3, 2]],             # 10
   [[-1, 3], 1, Concat, [1]],              # 11
   [-1, 3, C3, [256, False]],               # 12
   [-1, 1, CBAM, [256]],                    # 13
   [-1, 1, Conv, [256, 3, 2]],             # 14
   [[-1, 0], 1, Concat, [1]],              # 15
   [-1, 3, C3, [512, False]],               # 16
   [-1, 1, CBAM, [512]],                    # 17
   [-1, 1, Detect, [nc, anchors]]          # 18
  ]
